#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ПрограммныйИнтерфейс

Функция ОперацияПоДокументу(ДокументСсылка) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	uu_ОперацияКОтражениюВУпрУчете.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.uu_ОперацияКОтражениюВУпрУчете КАК uu_ОперацияКОтражениюВУпрУчете
	|ГДЕ
	|	uu_ОперацияКОтражениюВУпрУчете.ПервичныйДокумент = &ПервичныйДокумент";
	Запрос.УстановитьПараметр("ПервичныйДокумент", ДокументСсылка);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Ссылка;
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

#КонецОбласти
	
#КонецЕсли