
&НаСервереБезКонтекста
Процедура ОтправитьПовторноНаСервере()
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	uu_ОчередьСообщений.Топик КАК Топик,
	|	uu_ОчередьСообщений.Объект КАК Объект,
	|	uu_ОчередьСообщений.ДатаДобавления КАК ДатаДобавления
	|ИЗ
	|	РегистрСведений.uu_ОчередьСообщений КАК uu_ОчередьСообщений
	|ГДЕ
	|	uu_ОчередьСообщений.ПопытокОтправки = 10";
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		Запись = РегистрыСведений.uu_ОчередьСообщений.СоздатьМенеджерЗаписи();
		
		ЗаполнитьЗначенияСвойств(Запись, Выборка);
		
		Запись.Прочитать();
		
		Если Запись.Выбран() Тогда
			
			Запись.ОшибкиОтправки = "";
			Запись.ПопытокОтправки = 0;
			Запись.ДатаСледующейОтправки = Дата(1, 1, 1);
			
			Запись.Записать();
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ОтправитьПовторно(Команда)
	
	ОтправитьПовторноНаСервере();
	
	Элементы.Список.Обновить();
	
КонецПроцедуры
